# CannotDrawSweptblend Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SweptBlendFailures..::..CannotDrawSweptblend Property
BuiltInFailures..::..SweptBlendFailures Class See Also
---
Can't create swept blend.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDrawSweptblend { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDrawSweptblend As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDrawSweptblend {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SweptBlendFailures Class
Autodesk.Revit.DB Namespace